// Написать программу, которая из имеющегося массива целых чисел формирует массив из четных чисел.
// Первоначальный массив можно ввести с клавиатуры, либо сгенерировать случайным образом.
// При решении неnрекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

int [] CreateArray = new int [10]; // Создаем массив
System.Console.WriteLine ("Имеющийся массив: ");
